// Массивы в JavaScript нужно для таго чтобы упорядичить данных: 
// С помощю массива мы можем в начале или в конце добавить допольниьельный данных или их изменить 
// Есть два варианта синтаксиса для создания пустого массива:
// ()
// []
// Например

const cars = ['Мазда' ,'Форд' , 'Мерседес' , 'BMW'];
cars.push('Рено')
cars.unshift('Волга')
console.log(cars);


let фрукты = ["Яблоко", "Апельсин", "Арбуз"];

alert( фрукты[0] ); // Яблоко
alert( фрукты[2] ); // Апельсин
alert( фрукты[1] ); // Арбуз