// В JavaScript есть две чаще всего используемые структуры данных – это Object и Array.
// Объекты позволяют нам создавать одну сущность, которая хранит элементы данных по ключам.
// Массивы позволяют нам собирать элементы данных в упорядоченный список.

// Деструктурирующее присваивание – это специальный синтаксис, который позволяет нам «распаковать» массивы или объекты в несколько переменных, так как иногда они более удобны.
// Например
// let arr = ["Ilya", "Kantor"];
// let [firstName, surname] = arr;
// alert(firstName); // Ilya
// alert(surname);  // Kantor


// let user = {};
// [user.name, user.surname] = "Ilya Kantor".split(' ');

// alert(user.name); 
// alert(user.surname);